In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv("titanic.csv",usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [3]:
df['Age_capt']=np.where(df['Age'].isnull(),1,0)

In [4]:
df.head()

   Survived   Age     Fare  Age_capt
0         0  22.0   7.2500         0
1         1  38.0  71.2833         0
2         1  26.0   7.9250         0
3         1  35.0  53.1000         0
4         0  35.0   8.0500         0

In [5]:
df['Age'].fillna(df.Age.median(),inplace=True)

In [6]:
df.head(6)

   Survived   Age     Fare  Age_capt
0         0  22.0   7.2500         0
1         1  38.0  71.2833         0
2         1  26.0   7.9250         0
3         1  35.0  53.1000         0
4         0  35.0   8.0500         0
5         0  28.0   8.4583         1